app/controllers/api/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."sub_identifier" = $1 LIMIT $2  [["sub_identifier", "Investing"], ["LIMIT", 1]]
---
    def index
      @posts = Post.where(:sub_identifier => params[:sub_identifier])

INSERT INTO "posts" ("title", "post_body", "created_at", "updated_at", "sub_identifier") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "AT&T"], ["post_body", "Stock did well on earnings beat!"], ["created_at", "2020-10-23 04:30:17.837158"], ["updated_at", "2020-10-23 04:30:17.837158"], ["sub_identifier", "Investing"]]
---
    def create
        @post = Post.new(post_params)

        if @post.save