app/controllers/api/searchs_controller.rb

    def index
        name = params[:search]
        @subs = Sub.where("sub_title LIKE ?", "%#{name}%")
---
SELECT "subs".* FROM "subs" WHERE (sub_title LIKE '%P%')