app/controllers/api/subs_controller.rb

    def show
        @sub = Sub.find_by(sub_title: params[:sub_title])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."sub_title" = $1 LIMIT $2  [["sub_title", "Investing"], ["LIMIT", 1]]

    def create
        @sub = Sub.new(sub_params)

        if @sub.save
---
INSERT INTO "subs" ("sub_title", "sub_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_title", "computers"], ["sub_description", "A sub dedicated to computers."], ["created_at", "2020-11-11 02:08:04.625178"], ["updated_at", "2020-11-11 02:08:04.625178"]]